Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.airflow.helm_release.airflow will be created
+ resource "helm_release" "airflow" {
      + atomic                     = false
      + chart                      = "airflow"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "airflow"
      + namespace                  = "airflow"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://airflow-helm.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "8.9.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.airflow.kubernetes_manifest.airflow-cluster-role will be created
+ resource "kubernetes_manifest" "airflow-cluster-role" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "ClusterRole"
          + metadata   = {
              + name = "airflow-pod-creation"
            }
          + rules      = [
              + {
                  + apiGroups = [
                      + "",
                    ]
                  + resources = [
                      + "pods",
                      + "secrets",
                    ]
                  + verbs     = [
                      + "create",
                      + "get",
                      + "delete",
                      + "list",
                      + "patch",
                      + "watch",
                    ]
                },
            ]
        }
      + object   = {
          + aggregationRule = {
              + clusterRoleSelectors = (known after apply)
            }
          + apiVersion      = "rbac.authorization.k8s.io/v1"
          + kind            = "ClusterRole"
          + metadata        = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "airflow-pod-creation"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + rules           = [
              + {
                  + apiGroups       = [
                      + "",
                    ]
                  + nonResourceURLs = (known after apply)
                  + resourceNames   = (known after apply)
                  + resources       = [
                      + "pods",
                      + "secrets",
                    ]
                  + verbs           = [
                      + "create",
                      + "get",
                      + "delete",
                      + "list",
                      + "patch",
                      + "watch",
                    ]
                },
            ]
        }
    }

  # module.airflow.kubernetes_manifest.airflow-cluster-role-binding will be created
+ resource "kubernetes_manifest" "airflow-cluster-role-binding" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "ClusterRoleBinding"
          + metadata   = {
              + name = "airflow-pod-creation"
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "ClusterRole"
              + name     = "airflow-pod-creation"
            }
          + subjects   = [
              + {
                  + kind      = "ServiceAccount"
                  + name      = "airflow-worker"
                  + namespace = "airflow"
                },
            ]
        }
      + object   = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "ClusterRoleBinding"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "airflow-pod-creation"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "ClusterRole"
              + name     = "airflow-pod-creation"
            }
          + subjects   = [
              + {
                  + apiGroup  = (known after apply)
                  + kind      = "ServiceAccount"
                  + name      = "airflow-worker"
                  + namespace = "airflow"
                },
            ]
        }
    }

  # module.airflow.kubernetes_manifest.airflow-gateway will be created
+ resource "kubernetes_manifest" "airflow-gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "airflow-vs"
              + namespace = "airflow"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "airflow.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "airflow.airflow.svc.cluster.local"
                                  + port = {
                                      + number = 8080
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "airflow-vs"
              + namespace                  = "airflow"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "airflow.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "airflow.airflow.svc.cluster.local"
                                  + port   = {
                                      + number = 8080
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.airflow.kubernetes_manifest.airflow-sa will be created
+ resource "kubernetes_manifest" "airflow-sa" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "ServiceAccount"
          + metadata   = {
              + name      = "airflow-worker"
              + namespace = "airflow"
            }
        }
      + object   = {
          + apiVersion                   = "v1"
          + automountServiceAccountToken = (known after apply)
          + imagePullSecrets             = (known after apply)
          + kind                         = "ServiceAccount"
          + metadata                     = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "airflow-worker"
              + namespace                  = "airflow"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + secrets                      = (known after apply)
        }
    }

  # module.harbor.harbor_retention_policy.fetch-system-retention will be updated in-place
~ resource "harbor_retention_policy" "fetch-system-retention" {
        id       = "/retentions/1"
        # (2 unchanged attributes hidden)

      ~ rule {
          ~ untagged_artifacts     = false -> true
            # (10 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 5 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
